Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# UserGuide_FirstDocument_Step1.Text
source: Open Knowledge Vault (Ctrl+I), then drag a PDF, Word doc, Markdown, text, code, or web URL onto the window. Alternatively click Import to use the system file picker, paste a URL to ingest a web page, or drag a whole folder to recursively import everything inside it. The first import also kicks off auto-tagging and duplicate detection.
de: Öffnen Sie den Wissens-Tresor (Strg+I), und ziehen Sie ein PDF, Word-Dokument, Markdown, Text, Code oder eine Web-URL auf das Fenster. Alternativ klicken Sie auf Importieren, um die System-Dateiauswahl zu nutzen, fügen eine URL ein, um eine Webseite zu erfassen, oder ziehen einen ganzen Ordner, um rekursiv alles darin zu importieren. Der erste Import startet auch Auto-Tagging und Duplikaterkennung.
es: Abra la Bóveda de Conocimiento (Ctrl+I) y haga clic en Importar archivos para elegir uno o varios archivos, o en Importar carpeta para importar todos los archivos compatibles de una carpeta y sus subcarpetas. Mientras la lista de la bóveda siga vacía, también puede arrastrar archivos o carpetas a su zona de colocación. Importar archivos y la colocación comprueban primero si hay copias exactas de documentos que ya están en la bóveda: los duplicados se muestran y usted elige Omitir duplicados o Importar todo. Las páginas web entran por Importación web.
fr: Ouvrez le Coffre-fort de Connaissances (Ctrl+I), puis glissez un PDF, un document Word, du Markdown, du texte, du code ou une URL web sur la fenêtre. Vous pouvez aussi cliquer sur Importer pour utiliser le sélecteur de fichiers système, coller une URL pour ingérer une page web, ou glisser un dossier entier pour tout importer récursivement. La première importation lance également l’auto-étiquetage et la détection de doublons.
ja: Knowledge Vault(Ctrl+I)を開き、PDF、Word、Markdown、テキスト、コード、または Web URL をウィンドウにドラッグします。あるいは「インポート」をクリックしてシステムのファイル ピッカーを使用、URL を貼り付けて Web ページを取り込み、フォルダーをドラッグして中身を再帰的にインポートします。最初のインポートでは自動タグ付けと重複検出も開始されます。
zh_cn: 打开 Knowledge Vault(Ctrl+I),将 PDF、Word、Markdown、文本、代码或网页 URL 拖到窗口上。也可以点击“导入”使用系统文件选择器、粘贴 URL 摄取一个网页,或拖入整个文件夹递归导入其中所有文件。首次导入还会启动自动打标签和重复检测。

# UserGuide_FirstDocument_Step2_Title.Text
source: Step 2: Wait for Indexing
de: Schritt 2: Auf Indexierung warten
es: Paso 2: Esperar la indexación
fr: Étape 2 : Attendre l’indexation
ja: ステップ 2: インデックス作成を待つ
zh_cn: 步骤 2:等待建索引

# UserGuide_FirstDocument_Step2.Text
source: Indexing extracts text via the format-specific parser, chunks the content into ~512-token semantic segments with overlap, runs each chunk through your embedding model, and writes vectors to the HNSW index plus FTS5 keyword index. Time scales with size: a typical PDF takes 5-30 seconds, a 1,000-page book around 2 minutes. Progress shows live in the Vault row and in Operations (Ctrl+Shift+O).
de: Die Indexierung extrahiert Text über den formatspezifischen Parser, zerlegt den Inhalt in semantische Segmente von ~512 Tokens mit Überlappung, läuft jeden Chunk durch Ihr Embedding-Modell und schreibt Vektoren in den HNSW-Index sowie den FTS5-Schlüsselwortindex. Die Dauer skaliert mit der Größe: Ein typisches PDF benötigt 5–30 Sekunden, ein 1.000-seitiges Buch rund 2 Minuten. Der Fortschritt wird live in der Tresor-Zeile und in Operations (Strg+Umschalt+O) angezeigt.
es: Cada archivo se lee, se divide en fragmentos (512 tokens con 50 de superposición de forma predeterminada), se convierte en embeddings con el modelo de embeddings y se añade a los índices vectorial y de palabras clave; después, el modelo de IA sugiere hasta cinco etiquetas. Mientras tanto, la fila del documento muestra Pendiente o Procesando, y luego Indexado; una fila Fallido indica el motivo (consulte Solución de problemas). Lo que tarda depende del tamaño del archivo y de su equipo.
fr: L’indexation extrait le texte via l’analyseur spécifique au format, découpe le contenu en segments sémantiques d’environ 512 tokens avec recouvrement, fait passer chaque morceau dans votre modèle d’embeddings et écrit les vecteurs dans l’index HNSW plus l’index de mots-clés FTS5. Le temps varie avec la taille : un PDF typique prend 5 à 30 secondes, un livre de 1 000 pages environ 2 minutes. La progression s’affiche en direct dans la ligne du Coffre-fort et dans Operations (Ctrl+Maj+O).
ja: インデックス作成では、フォーマット固有のパーサーでテキストを抽出し、内容を約 512 トークンのセマンティック セグメント(重複付き)に分割し、各チャンクを埋め込みモデルに通し、ベクトルを HNSW インデックスおよび FTS5 キーワード インデックスへ書き込みます。所要時間はサイズに比例し、一般的な PDF で 5〜30 秒、1,000 ページの書籍で約 2 分です。進捗は Vault の行および Operations(Ctrl+Shift+O)にライブ表示されます。
zh_cn: 建索引会通过格式特定的解析器提取文本,把内容切分为约 512 token、带重叠的语义片段,逐片送入您选择的嵌入模型,并将向量写入 HNSW 索引和 FTS5 关键词索引。耗时与体量相关:一份典型 PDF 需 5–30 秒,一本 1,000 页的书约 2 分钟。Vault 行与 Operations(Ctrl+Shift+O)中实时显示进度。

# UserGuide_FirstDocument_Step3_Title.Text
source: Step 3: Ask Questions
de: Schritt 3: Fragen stellen
es: Paso 3: Hacer preguntas
fr: Étape 3 : Poser des questions
ja: ステップ 3: 質問する
zh_cn: 步骤 3:提出问题

# UserGuide_FirstDocument_Step3.Text
source: Open AI Chat, scope the conversation to the freshly imported document (or skip scoping to query the whole vault), and ask. Try "What are the main points?", "Summarize the key arguments and counter-arguments," or "What evidence does the author provide for their central claim?" Every answer renders with numbered citations linking back to the exact passages used.
de: Öffnen Sie AI Chat, beschränken Sie die Konversation auf das frisch importierte Dokument (oder überspringen Sie das, um den gesamten Tresor abzufragen) und stellen Sie Ihre Frage. Versuchen Sie „Was sind die Kernpunkte?", „Fasse die wichtigsten Argumente und Gegenargumente zusammen" oder „Welche Belege liefert der Autor für seine zentrale Behauptung?" Jede Antwort wird mit nummerierten Zitaten gerendert, die zurück zu den exakt verwendeten Passagen verlinken.
es: Abra Pregunta a tus archivos (Ctrl+3), deje el ámbito en Todas las colecciones o elija una colección, y pregunte, por ejemplo, «¿Cuáles son los puntos principales?» o «¿Qué pruebas da el autor de su tesis central?». La respuesta cita pasajes por número, como [1], y el panel Fuentes muestra cada pasaje citado con el nombre del documento, la página cuando el formato tiene páginas y un extracto. AI Chat no lee sus documentos, así que pregunte sobre ellos aquí.
fr: Ouvrez AI Chat, restreignez la conversation au document fraîchement importé (ou ignorez le scope pour interroger tout le coffre-fort) et posez votre question. Essayez « Quels sont les points principaux ? », « Résume les arguments clés et les contre-arguments », ou « Quelles preuves l’auteur fournit-il pour son affirmation centrale ? ». Chaque réponse est rendue avec des citations numérotées renvoyant aux passages exacts utilisés.
ja: AI Chat を開き、会話のスコープをインポートしたばかりのドキュメントに限定(またはスコープを省略して Vault 全体を検索)し、質問します。「主な要点は?」「主要な主張と反論を要約して」「著者は中心的な主張に対してどんな根拠を提供している?」などを試してください。各回答には番号付き引用が付き、使用された正確な箇所に戻ります。
zh_cn: 打开 AI Chat,将会话限定到刚导入的文档(或不限以查询整个 Vault),然后提问。可以试试“主要观点是什么?”、“总结核心论点与反论点”或“作者为其中心主张提供了哪些证据?”每条回答都带编号引用,指回所使用的确切片段。

# UserGuide_FirstDocument_Supported_Title.Text
source: Supported File Types
de: Unterstützte Dateitypen
es: Tipos de archivo admitidos
fr: Types de fichiers pris en charge
ja: 対応ファイル形式
zh_cn: 支持的文件类型

# UserGuide_FirstDocument_Supported.Text
source: Documents: PDF (with OCR fallback), DOCX, RTF, EPUB, HTML, Markdown, plain text, CSV/TSV, XLSX (sheet extraction), PPTX (slide extraction). Code: 30+ languages with syntax-aware chunking. Web: any URL via paste or the browser extension. Audio: MP3/M4A/WAV/FLAC via Audio Transcription. YouTube URLs trigger transcript ingestion. Images: PNG/JPG/JPEG via Tesseract OCR (and direct vision-model querying when the active model supports images).
de: Dokumente: PDF (mit OCR-Fallback), DOCX, RTF, EPUB, HTML, Markdown, Klartext, CSV/TSV, XLSX (Blattextraktion), PPTX (Folienextraktion). Code: 30+ Sprachen mit syntaxbewusster Chunk-Bildung. Web: jede URL per Einfügen oder über die Browser-Erweiterung. Audio: MP3/M4A/WAV/FLAC über Audio-Transkription. YouTube-URLs lösen Transkript-Ingestion aus. Bilder: PNG/JPG/JPEG via Tesseract OCR (und direkte Vision-Modell-Abfrage, wenn das aktive Modell Bilder unterstützt).
es: Documentos: PDF (solo la capa de texto, sin OCR), Word (.docx), texto sin formato y Markdown; los archivos .csv, .log, .json y .xml se leen como texto sin formato. Los archivos de código y de configuración, como .cs, .py, .js, .ts, .java, .go, .sql, .yaml e .ini, se leen como texto. Las imágenes (.png, .jpg, .jpeg, .bmp, .tiff) se leen con el OCR integrado en Windows. El audio (.mp3, .wav, .m4a, .flac, .ogg, .webm) se transcribe una vez instalado el modelo de voz a texto. Las páginas web y los subtítulos de YouTube entran por Importación web. Los archivos de Excel, PowerPoint, EPUB, RTF y .doc antiguos no son compatibles; la lista completa está en Formatos de archivo admitidos.
fr: Documents : PDF (avec OCR de secours), DOCX, RTF, EPUB, HTML, Markdown, texte brut, CSV/TSV, XLSX (extraction des feuilles), PPTX (extraction des diapositives). Code : plus de 30 langages avec un découpage sensible à la syntaxe. Web : toute URL collée ou via l’extension navigateur. Audio : MP3/M4A/WAV/FLAC via Transcription Audio. Les URL YouTube déclenchent l’ingestion de transcription. Images : PNG/JPG/JPEG via Tesseract OCR (et interrogation directe du modèle vision lorsque le modèle actif gère les images).
ja: ドキュメント: PDF(OCR フォールバック付き)、DOCX、RTF、EPUB、HTML、Markdown、プレーン テキスト、CSV/TSV、XLSX(シート抽出)、PPTX(スライド抽出)。コード: 30 以上の言語を構文認識チャンク分割で対応。Web: 貼り付けまたはブラウザー拡張からの任意の URL。音声: MP3/M4A/WAV/FLAC を Audio Transcription 経由で対応。YouTube URL は文字起こしの取り込みを起動。画像: PNG/JPG/JPEG を Tesseract OCR で(アクティブ モデルが画像対応の場合はビジョン モデルでの直接クエリも)。
zh_cn: 文档:PDF(带 OCR 兜底)、DOCX、RTF、EPUB、HTML、Markdown、纯文本、CSV/TSV、XLSX(按工作表抽取)、PPTX(按幻灯片抽取)。代码:30 多种语言并支持语法感知分块。网页:任意 URL,可粘贴或经浏览器扩展导入。音频:MP3/M4A/WAV/FLAC,经 Audio Transcription。YouTube URL 触发字幕摄取。图片:PNG/JPG/JPEG,经 Tesseract OCR(当激活模型支持图像时也支持视觉模型直接查询)。

# UserGuide_WebSearch_Title.Text
source: Web Search & Research
de: Websuche & Recherche
es: Búsqueda web e investigación
fr: Recherche Web et investigation
ja: Web 検索とリサーチ
zh_cn: 网页搜索与调研

# UserGuide_WebSearch_Description.Text
source: Research Mode adds live web search results to AI Chat answers. You choose one search provider in Settings (Brave Search, Serper or a SearXNG instance) and turn Research Mode on there, then switch it on in the chat with the globe button beside the message box. The text of each message you send becomes the search query, and the titles, addresses and snippets of the results go to the model with your question. Results are cached for the Cache Duration set in Settings.
de: Der Recherchemodus ergänzt Antworten in AI Chat um aktuelle Websuchergebnisse. Sie wählen in den Einstellungen einen Suchanbieter (Brave Search, Serper oder eine SearXNG-Instanz) und aktivieren dort den Recherchemodus; im Chat schalten Sie ihn dann mit der Globus-Schaltfläche neben dem Nachrichtenfeld ein. Der Text jeder gesendeten Nachricht wird zur Suchanfrage, und Titel, Adressen und Textauszüge der Ergebnisse gehen zusammen mit Ihrer Frage an das Modell. Ergebnisse werden für die in den Einstellungen festgelegte Cache-Dauer zwischengespeichert.
es: El modo investigación añade resultados de búsqueda web en directo a las respuestas de AI Chat. Elija un proveedor de búsqueda en Configuración (Brave Search, Serper o una instancia de SearXNG) y active allí el modo investigación; después actívelo en el chat con el botón del globo situado junto al cuadro de mensaje. El texto de cada mensaje que envía se convierte en la consulta de búsqueda, y los títulos, direcciones y fragmentos de los resultados llegan al modelo junto con su pregunta. Los resultados se guardan en caché durante la Duración de caché definida en Configuración.
fr: Le mode recherche ajoute des résultats de recherche web en direct aux réponses d'AI Chat. Choisissez un fournisseur de recherche dans les Paramètres (Brave Search, Serper ou une instance SearXNG) et activez-y le mode recherche, puis activez-le dans le chat avec le bouton en forme de globe à côté de la zone de message. Le texte de chaque message envoyé devient la requête de recherche, et les titres, adresses et extraits des résultats sont transmis au modèle avec votre question. Les résultats sont mis en cache pendant la Durée du cache définie dans les Paramètres.
ja: リサーチ モードは、AI Chat の回答にリアルタイムの Web 検索結果を加えます。設定で検索プロバイダー (Brave Search、Serper、または SearXNG インスタンス) を 1 つ選んでリサーチ モードを有効にし、チャットではメッセージ ボックスの横にある地球儀ボタンでオンにします。送信したメッセージのテキストがそのまま検索クエリになり、検索結果のタイトル、アドレス、スニペットが質問とともにモデルに渡されます。結果は、設定の [キャッシュ期間] の間キャッシュされます。
zh_cn: 研究模式会在 AI Chat 的回答中加入实时网页搜索结果。在“设置”中选择一个搜索提供商（Brave Search、Serper 或 SearXNG 实例）并启用研究模式，然后在聊天中点击消息框旁的地球按钮将其打开。您发送的每条消息的文本都会作为搜索查询，搜索结果的标题、地址和摘要会与您的问题一起发送给模型。结果会在“设置”中指定的缓存时长内被缓存。

# UserGuide_WebSearch_HowItWorks_Title.Text
source: How Web Search Works
de: So funktioniert die Websuche
es: Cómo funciona la búsqueda web
fr: Comment fonctionne la recherche Web
ja: Web 検索の仕組み
zh_cn: 网页搜索的工作方式

# UserGuide_WebSearch_Step1.Text
source: Set up a provider - In Settings, under Research Mode, choose the Search Provider: Brave Search or Serper (paste its API key) or SearXNG (enter your instance URL, for example http://localhost:8080). Only the selected provider is used, with no fallback to another one if it fails. Max Search Results (1 to 20, 10 by default) sets how many results an answer gets.
de: Anbieter einrichten - Wählen Sie in den Einstellungen unter „Recherchemodus“ den Suchanbieter: Brave Search oder Serper (API-Schlüssel einfügen) oder SearXNG (URL Ihrer Instanz eingeben, zum Beispiel http://localhost:8080). Verwendet wird nur der ausgewählte Anbieter; fällt er aus, wird nicht auf einen anderen ausgewichen. „Max. Suchergebnisse“ (1 bis 20, standardmäßig 10) legt fest, wie viele Ergebnisse eine Antwort erhält.
es: Configure un proveedor - En Configuración, en Modo investigación, elija el Proveedor de búsqueda: Brave Search o Serper (pegue su clave de API) o SearXNG (escriba la URL de su instancia, por ejemplo http://localhost:8080). Solo se usa el proveedor seleccionado; si falla, no se recurre a otro. Resultados de búsqueda máx. (de 1 a 20, 10 de forma predeterminada) fija cuántos resultados recibe una respuesta.
fr: Configurer un fournisseur - Dans les Paramètres, sous Mode recherche, choisissez le Fournisseur de recherche : Brave Search ou Serper (collez sa clé d'API) ou SearXNG (saisissez l'URL de votre instance, par exemple http://localhost:8080). Seul le fournisseur sélectionné est utilisé ; s'il échoue, aucun autre ne prend le relais. Résultats de recherche max. (de 1 à 20, 10 par défaut) fixe le nombre de résultats fournis à une réponse.
ja: プロバイダーの設定：設定の [リサーチ モード] で検索プロバイダーを選びます。Brave Search または Serper (API キーを貼り付け)、SearXNG (インスタンスの URL を入力、例: http://localhost:8080) のいずれかです。使われるのは選んだプロバイダーだけで、失敗しても別のプロバイダーには切り替わりません。[最大検索結果数] (1～20、既定は 10) で、1 回の回答に使う結果の数を指定します。
zh_cn: 设置提供商：在“设置”的“研究模式”下选择搜索提供商：Brave Search 或 Serper（粘贴其 API 密钥），或 SearXNG（输入实例 URL，例如 http://localhost:8080）。只会使用所选的提供商，失败时不会改用其他提供商。“最多搜索结果数”（1 到 20，默认 10）决定每个回答获得多少条结果。

# UserGuide_WebSearch_Step2.Text
source: Search - With Enable Research Mode on in Settings and the globe button on in the chat, each message you send is searched as it is (the search gives up after 15 seconds). Pages are not opened or downloaded: only each result's title, address and snippet reach the model. If the search fails, times out or finds nothing, the answer is written without web results and a notice says so.
de: Suche - Ist in den Einstellungen „Recherchemodus aktivieren“ und im Chat die Globus-Schaltfläche eingeschaltet, wird jede gesendete Nachricht unverändert als Suchanfrage verwendet (die Suche gibt nach 15 Sekunden auf). Seiten werden weder geöffnet noch heruntergeladen: Nur Titel, Adresse und Textauszug jedes Ergebnisses erreichen das Modell. Schlägt die Suche fehl, dauert sie zu lange oder findet sie nichts, wird die Antwort ohne Webergebnisse geschrieben, und ein Hinweis sagt es Ihnen.
es: Búsqueda - Con Activar modo investigación encendido en Configuración y el botón del globo activado en el chat, cada mensaje que envía se busca tal cual (la búsqueda se abandona a los 15 segundos). Las páginas no se abren ni se descargan: al modelo solo llegan el título, la dirección y el fragmento de cada resultado. Si la búsqueda falla, se agota el tiempo o no encuentra nada, la respuesta se redacta sin resultados web y un aviso lo indica.
fr: Recherche - Avec Activer le mode recherche activé dans les Paramètres et le bouton en forme de globe activé dans le chat, chaque message envoyé est recherché tel quel (la recherche abandonne au bout de 15 secondes). Les pages ne sont ni ouvertes ni téléchargées : seuls le titre, l'adresse et l'extrait de chaque résultat parviennent au modèle. Si la recherche échoue, expire ou ne trouve rien, la réponse est rédigée sans résultats web et un avis le signale.
ja: 検索：設定の [リサーチ モードを有効化] と、チャットの地球儀ボタンの両方がオンの場合、送信したメッセージがそのまま検索されます (検索は 15 秒で打ち切られます)。ページを開いたりダウンロードしたりはせず、モデルに渡されるのは各結果のタイトル、アドレス、スニペットだけです。検索が失敗した、時間切れになった、何も見つからなかった場合は、Web の結果なしで回答が作成され、その旨が通知されます。
zh_cn: 搜索：当“设置”中的“启用研究模式”和聊天中的地球按钮都打开时，您发送的每条消息都会原样作为查询进行搜索（搜索 15 秒后放弃）。不会打开或下载网页：只有每条结果的标题、地址和摘要会发送给模型。如果搜索失败、超时或没有结果，回答将不使用网页结果，并会显示提示说明原因。

# UserGuide_WebSearch_Step3.Text
source: Answer - The model is asked to cite the results it uses as [1], [2] and so on. Under the answer, Web sources lists the results as numbered chips; click one to open the page in your browser (only http and https addresses open). The sources are saved with the message and come back when you reopen the conversation.
de: Antwort - Das Modell wird gebeten, die verwendeten Ergebnisse als [1], [2] usw. zu zitieren. Unter der Antwort listet „Webquellen“ die Ergebnisse als nummerierte Chips auf; ein Klick öffnet die Seite im Browser (nur http- und https-Adressen werden geöffnet). Die Quellen werden mit der Nachricht gespeichert und erscheinen wieder, wenn Sie die Unterhaltung erneut öffnen.
es: Respuesta - Se pide al modelo que cite los resultados que usa como [1], [2], etc. Debajo de la respuesta, Fuentes web muestra los resultados como fichas numeradas; haga clic en una para abrir la página en el navegador (solo se abren direcciones http y https). Las fuentes se guardan con el mensaje y vuelven a aparecer al reabrir la conversación.
fr: Réponse - Le modèle est invité à citer les résultats qu'il utilise sous la forme [1], [2], etc. Sous la réponse, Sources web liste les résultats sous forme de puces numérotées ; cliquez sur l'une d'elles pour ouvrir la page dans votre navigateur (seules les adresses http et https s'ouvrent). Les sources sont enregistrées avec le message et réapparaissent quand vous rouvrez la conversation.
ja: 回答：モデルには、使った結果を [1]、[2] のように引用するよう指示されます。回答の下の「Web ソース」に結果が番号付きのチップとして表示され、クリックするとブラウザーでページが開きます (開くのは http と https のアドレスだけです)。ソースはメッセージとともに保存され、会話を開き直しても表示されます。
zh_cn: 回答：模型会被要求以 [1]、[2] 等形式引用所用的结果。回答下方的“网页来源”以编号标签列出这些结果；点击其中一个即可在浏览器中打开该网页（仅打开 http 和 https 地址）。来源会随消息一起保存，重新打开对话时仍会显示。

# UserGuide_WebSearch_Modes_Title.Text
source: Using Research Mode
de: Recherchemodus verwenden
es: Uso del modo investigación
fr: Utiliser le mode recherche
ja: リサーチ モードの使い方
zh_cn: 使用研究模式

# UserGuide_WebSearch_Mode1_Title.Text
source: Two Switches
de: Zwei Schalter
es: Dos interruptores
fr: Deux interrupteurs
ja: 2 つのスイッチ
zh_cn: 两个开关

# UserGuide_WebSearch_Mode1_Description.Text
source: Research Mode needs both Enable Research Mode in Settings and the globe button beside the chat's message box. If the Settings switch is off or no provider is set up, the chat says once why no web search was made and answers without web results. Nothing detects on its own that a question needs current information.
de: Der Recherchemodus braucht beides: „Recherchemodus aktivieren“ in den Einstellungen und die Globus-Schaltfläche neben dem Nachrichtenfeld im Chat. Ist der Schalter in den Einstellungen aus oder kein Anbieter eingerichtet, erklärt der Chat einmal, warum keine Websuche stattfand, und antwortet ohne Webergebnisse. Nichts erkennt von selbst, dass eine Frage aktuelle Informationen braucht.
es: El modo investigación necesita las dos cosas: Activar modo investigación en Configuración (el interruptor indica El chat puede añadir resultados web cuando está activado y Sin búsqueda web cuando está desactivado) y el botón del globo junto al cuadro de mensaje del chat. Si el interruptor de Configuración está apagado o no hay ningún proveedor configurado, el chat explica una vez por qué no se hizo ninguna búsqueda web y responde sin resultados web. Nada detecta por sí solo que una pregunta necesita información actual.
fr: Le mode recherche nécessite les deux : Activer le mode recherche dans les Paramètres et le bouton en forme de globe à côté de la zone de message du chat. Si l'interrupteur des Paramètres est désactivé ou qu'aucun fournisseur n'est configuré, le chat explique une fois pourquoi aucune recherche web n'a eu lieu et répond sans résultats web. Rien ne détecte de lui-même qu'une question demande des informations récentes.
ja: リサーチ モードを使うには、設定の [リサーチ モードを有効化] と、チャットのメッセージ ボックスの横にある地球儀ボタンの両方が必要です。設定のスイッチがオフの場合やプロバイダーが設定されていない場合、チャットは Web 検索を行わなかった理由を一度だけ表示し、Web の結果なしで回答します。質問に最新情報が必要かどうかを自動で判断する機能はありません。
zh_cn: 研究模式需要两个开关同时打开：“设置”中的“启用研究模式”和聊天消息框旁的地球按钮。如果“设置”中的开关关闭或未配置提供商，聊天会提示一次未进行网页搜索的原因，并在不使用网页结果的情况下回答。系统不会自动判断问题是否需要最新信息。

# UserGuide_WebSearch_Mode2_Title.Text
source: Sources in Exports
de: Quellen in Exporten
es: Fuentes en las exportaciones
fr: Sources dans les exports
ja: エクスポートでのソース
zh_cn: 导出中的来源

# UserGuide_WebSearch_Mode2_Description.Text
source: Because the sources are stored with each answer, a conversation export can include them: turn on Include citations in the export dialog to list each answer's sources under it, numbered as its [n] markers. There is no /search prefix and no separate Web button in the message box.
de: Da die Quellen mit jeder Antwort gespeichert werden, kann ein Export der Unterhaltung sie enthalten: Schalten Sie im Exportdialog „Quellenangaben einschließen“ ein, um die Quellen jeder Antwort darunter aufzulisten, nummeriert wie ihre [n]-Markierungen. Ein Präfix /search oder eine eigene Web-Schaltfläche im Nachrichtenfeld gibt es nicht.
es: Como las fuentes se guardan con cada respuesta, una exportación de la conversación puede incluirlas: active Incluir citas en el cuadro de exportación para mostrar las fuentes de cada respuesta debajo de ella, numeradas como sus marcas [n]. No existe el prefijo /search ni un botón Web aparte en el cuadro de mensaje.
fr: Comme les sources sont enregistrées avec chaque réponse, l'export d'une conversation peut les inclure : activez Inclure les citations dans la boîte d'export pour lister les sources de chaque réponse sous celle-ci, numérotées comme ses repères [n]. Il n'existe ni préfixe /search ni bouton Web distinct dans la zone de message.
ja: ソースは回答ごとに保存されるため、会話のエクスポートに含めることができます。エクスポート ダイアログで [引用を含める] をオンにすると、各回答の下にそのソースが [n] の番号どおりに一覧表示されます。メッセージ ボックスに /search プレフィックスや専用の Web ボタンはありません。
zh_cn: 由于来源随每个回答一起保存，导出对话时可以包含它们：在导出对话框中打开“包含引用”，即可在每个回答下方按其 [n] 标记的编号列出来源。消息框中没有 /search 前缀，也没有单独的 Web 按钮。

# UserGuide_WebSearch_Mode3_Title.Text
source: Vault and Web Stay Separate
de: Tresor und Web bleiben getrennt
es: Bóveda y web por separado
fr: Coffre-fort et web restent séparés
ja: Vault と Web は別々
zh_cn: Vault 与网页分开
